//------------------------------------------------------------------------------
// parallelepiped.cpp - содержит методы параллелепипеда
//------------------------------------------------------------------------------

#include "parallelepiped.h"

//------------------------------------------------------------------------------
// Ввод параметров параллелепипеда из файла
void Parallelepiped::In(ifstream &ifst) {
    ifst >> density >> a >> b >> c;
}

// Случайный ввод параметров параллелепипеда
void Parallelepiped::InRnd() {
    density = Shape::rnd20.Get();
    a = Shape::rnd20.Get();
    b = Shape::rnd20.Get();
    c = Shape::rnd20.Get();
}

//------------------------------------------------------------------------------
// Вывод параметров параллелепипеда в форматируемый поток
void Parallelepiped::Out(ofstream &ofst) {
    ofst << "It is Parallelepiped: a = " << a << ", b = " << b << ", c = " << c
         << ". Volume = " << Volume() << "\n";
}

//------------------------------------------------------------------------------
// Вычисление объёма параллелепипеда
double Parallelepiped::Volume() {
    return (a * b * c);
}
