//------------------------------------------------------------------------------
// tetrahedron.cpp - содержит функции обработки тетраэдра
//------------------------------------------------------------------------------

#include <cmath>
#include "tetrahedron.h"

//------------------------------------------------------------------------------
// Ввод параметров тетраэдра из потока
void Tetrahedron::In(ifstream &ifst) {
    ifst >> density >> a;
}

// Случайный ввод параметров тетраэдра
void Tetrahedron::InRnd() {
    density = Shape::rnd20.Get();
    a = Shape::rnd20.Get();
}

//------------------------------------------------------------------------------
// Вывод параметров тетраэдра в поток
void Tetrahedron::Out(ofstream &ofst) {
    ofst << "It is Tetrahedron: a = "
         << a
         << ". Volume = " << Volume() << "\n";
}

//------------------------------------------------------------------------------
// Вычисление объёма тетраэдра
double Tetrahedron::Volume() {
    return double(a * a * a * sqrt(2) / 12);
}
